{
    "A2IC3NZN488KWK": [
        "As someone who has never possessed the manual dexterity or patience for creating jewelry, I think that I could actually make something after reading this new book.The book is bursting with exceptional up-close photography which walks you easily through each process.  The explanations of basic tools and techniques are written clearly and for those without any jewelry making experience, it all makes sense!  Once you learn the how tos of working with different organic elements, the book teaches you numerous beginner and intermediate projects. Again, the photography is exceptional and the instructions easy to understand.If you've had the desire to learn jewelry making, especially using sea glass or other natural elements,  I highly recommend this book to you",
        "Some days ago I received my fabulous book: Organic Wire and Metal Jewelry. I'm in love with my book. Love the pictures and the instructions are simple and clear. I loved all the projects and I'm sure everyone who has purchased the book. think like me",
        "I love the ideas but have no access sea glass, but will experiment with other stones ... but I do love the book.  Great job",
        "beautiful layout and fun pictures. as a collector of beach glass it is great to see other ways to use it beside a mason jar in the window"
    ],
    "A30FG02C424EJ5": [
        "Well written and beautifully illustrated.  Features unique designs using gemstones and/or beach glass. A definite must have for anyone looking for new designs and different mediums to work with",
        "This beautifully photographed book provides step-by-step instruction from beginner level to more advanced projects in hand-crafted jewelry using sea glass, stones, and crystals. Having admired and worn Beth Martin's jewelry crafted from sea glass found along the shores of Lake Erie, I thoroughly enjoyed reading about the materials, tools, and skills that combine to make stunning, one-of-a-kind wearable art. This book has everything the beginner needs to produce lovely pieces, and, with 50 different projects, it offers ideas and inspiration for the seasoned and skilled jewelry designer as well",
        "great",
        "Loved their approach in this book and that it was a \"paperback\".  Easy to use and inspiring me to use up my beachcombing finds"
    ],
    "A1G26EYQGW3YF1": [
        "Nice patterns",
        "just what I wanted",
        "love the spirit of the book and some of the projects",
        "Fantastic book - good directions, good projects.  The only recommendation I can offer is that some of the pictures are \"reversed\" to the directions so it just requires a bit of study and \"recalculation\" to reconcile the two; otherwise, wonderful book"
    ],
    "A62O7C5RQB353": [
        "This is a fabulous book! The designs are wonderful, but what I consider even better are the photographs of the projects, directions for the designs, and explanations of the techniques",
        "If you're an experienced wire jewelry maker, there's not much new to be found in this book. There are a few clever ideas, but overall, the look of the projects is pretty amateurish. \"Stunning\", is an overstatement",
        "Beautiful pictures and easily understood",
        "A very good book.  I loved the projects in the book and it inspired me to create some new designs.  I would definitely recommend it"
    ],
    "AA7PNT2OPS3RP": [
        "I love this book! There are some very lovely ideas in this book. It is just full of inspiration and beautiful photography.It's a great book for your jewelry-making library",
        "I wanted to support a fellow sea glasser by buying this book and hoped to get some nice ideas and tips from it. I do believe it will provide all of that and enjoy the easy read of it! I saw only 1 editing error, LOL, which in no way ruined the quality of the book! Thank you so much",
        "Great projects that I'll be able to personalize for any occasion. The only thing better than the instruction in this book is to be in one of Eva's classes--she's a wonderful teacher"
    ]
}